[
  {
    "id": 6,
    "title": "*OTY 2025",
    "icon": "img/logo.png",
    "date": "2025-12-31",
    "verdict": [
      "The year 2025 had its ups and downs for me (again) personally.",
      " I played a lot more games on the PS5 compared to previous years, but I still finished 26 games on mobile, which is slightly above my average of 2 games per month.",
      " Out of them, only 5 were actually released this year. So picking a GOTY is simple (or not?), but probably not objective.",
      " Looking at other mobile GOTY lists, the good news is that I played most of the picks; I simply did not finish them (but plan to).",
      " On the other hand, I finished some amazing leftovers (like Death's Door or A Monster's Expedition).",
      " One trend I would like to mention—and I have to adapt to—is that most of the (from my point of view) best mobile games didn't get discounted heavily.",
      " So next year, I will probably just buy those of interest to me right away (as I did for only a few this year).<br/>",
      "So without further ado, my mobile GOTY of 2025 is... a split between <a href=\"https://apps.apple.com/us/app/spooky-express/id6738424828\" target=\"_blank\">Spooky Express</a>",
      " and <a href=\"https://apps.apple.com/us/app/pine-hearts/id6745611937\" target=\"_blank\">Pine Hearts</a>! Both were great in their own way.",
      " As I mentioned in my thoughts, Spooky Express brings some of the most satisfying puzzles ever (and my name in the credits),",
      " and Pine Hearts is just lovely overall and close to my heart due to the topic of fighting personal demons.<br/>",
      "My video game music OTY is, without any hesitation, Absolum. I did not like a lot of Gareth's music since the second Ori, but this album just slaps!",
      " The Green River and Dracoraptor Mountains combo are two of the best tracks I heard all year.<br/>",
      "My movie OTY is F1. This year was about all kinds of F1-related things for me and my family (Hot Wheels, LEGO, etc.).",
      " I did not expect much of the movie (and I'm definitely not a fan of the main actor), even though I liked Maverick a lot, but was pleasantly surprised.",
      " Oh, and its soundtrack is very cool, too."
    ]
  },
  {
    "id": 5,
    "title": "Coffee Pool",
    "link": "https://apps.apple.com/us/app/coffee-pool/id6737482186",
    "icon": "https://is1-ssl.mzstatic.com/image/thumb/Purple211/v4/8f/a6/fd/8fa6fda0-dc8b-61fa-547b-905c598d6b52/AppIcon-0-0-1x_U007emarketing-0-8-0-85-220.png/340x340bb.webp",
    "date": "2025-09-22",
    "verdict": [
      "We have a saying in Slovakia that translates roughly to \"exception proves the rule.\" As much as I dislike ads in games, every now and then I come across one I enjoy despite them.",
      " As a former (semi-)professional pool billiards player, I'm a sucker for games inspired by the sport, like Smash Puck, Last Pocket, and more.",
      " I consider Subpar Pool to be one of the best, though I haven't finished it yet.<br/>",
      "And then came <a href=\"https://apps.apple.com/us/app/coffee-pool/id6737482186\" target=\"_blank\">Coffee Pool</a>...",
      " I participated in the beta testing and immediately knew it was going to be a great one. After the official release, I was sure of it.",
      " The game has excellent physics, precise aiming, and pocketing balls just feels right.",
      " I really enjoy progressing through the various leagues, but when I don't have much time, I just play the daily break.<br/>",
      "The folks at Shallot Games were kind enough to send me a promo code to remove the ads (so technically, I didn't break my \"personal codex\").",
      " As far as I know, there's no way to actually \"finish\" the game, so I decided to write this blog post as a token of gratitude.<br/>",
      "If you enjoy pool billiards-inspired games, you can't go wrong with this one. And if you don't believe me, you can always try it for yourself."
    ]
  },
  {
    "id": 4,
    "title": "Art of Rally",
    "link": "https://apps.apple.com/us/app/art-of-rally/id6459581344",
    "icon": "https://is1-ssl.mzstatic.com/image/thumb/Purple211/v4/e3/a3/f2/e3a3f2c8-44df-9a02-9235-8e191847dda6/AppIcon-0-0-1x_U007emarketing-0-7-0-85-220.png/340x340bb.webp",
    "date": "2025-08-23",
    "verdict": [
      "\"The only game that is both thrilling and relaxing at the same time.\" Those would have been my thoughts on the game, along with a shiny 5-star rating—if things hadn't gone sideways.",
      " Unfortunately, they did, and I'm quite disappointed. Here's the full story:<br/>",
      "I pre-ordered Art of Rally on iOS the second I learned it was coming, because I absolutely love its soundtrack. I listen to it a lot, mostly while driving my car.",
      " It's my go-to album when I'm not in the mood for anything else. Once the game was released, I started playing through the career mode.",
      " I knew it would take quite some time to finish, but I was in no rush. As new games were released, I played Art of Rally less, but I always came back to it.",
      " As mentioned in my one-liner, the game had an almost meditative effect on me. It even helped me face some of my demons—which is a lot to say about a video game.<br/>",
      "After almost 18 months, the long-awaited moment finally came: earning one of my most precious Game Center achievements—Master of Rally. But I never got it, due to a bug.",
      " I immediately contacted the devs through various channels, but they ignored me at first.",
      " When I finally heard back, they explained that only one person was handling customer support and that it would take time to get to my ticket. It's been three months since then...<br/>",
      "So yes, I finished Art of Rally, but it's not officially on my list because I've been waiting for a fix or at least some guidance, but I ultimately ran out of patience.",
      " The worrying part isn't just the bug—it's that a company currently porting games to mobile has such poor support.",
      " This experience has completely destroyed my trust in Noodlecake, and I'm certain I won't be pre-ordering or paying full price for any of their future releases."
    ]
  },
  {
    "id": 3,
    "title": "Finished GOTY 2024",
    "icon": "img/logo.png",
    "date": "2024-12-29",
    "verdict": [
      "Here are my overall top 5 games that I finished in 2024:<br/><br/>",
      "1. <a href=\"https://apps.apple.com/us/app/spiritfarer-netflix-edition/id1610577424\" target=\"_blank\">Spiritfarer</a>",
      " - I'm not really into managmenet (or gardening?) games, but this heartwarming gem helped me a lot to get through a quite difficult time. ",
      "Despite its heavy theme, it was pure joy to play it. And it's soundtrack is simply exceptional.<br/><br/>",
      "2. <a href=\"https://apps.apple.com/us/app/transistor/id948857526\" target=\"_blank\">Transistor</a>",
      " - I was a huge fan of Bastion back in 2011, so I always considered this one a must-play. After finally finishing it this year, I consder it a masterpiece.<br/><br/>",
      "3. <a href=\"https://apps.apple.com/us/app/braid-anniversary-edition/id6450126747\" target=\"_blank\">Braid, Anniversary Edition</a>",
      " - I never played the original and my brother did not quite finish it when it got released back in 2008... ",
      "Plus a former editor-in-chief of a gaming magazine once said that only really smart people can finish it without a guide. ",
      "All of this was additional motivation for me to finish it. Plus I could think about the levels even when not playing it which helped me a lot at that time.<br/><br/>",
      "4. <a href=\"https://apps.apple.com/us/app/arranger-netflix/id6450325217\" target=\"_blank\">Arranger</a>",
      " - Original, clever, funny, great looking and good sounding puzzling gem.<br/><br/>",
      "5. <a href=\"https://apps.apple.com/us/app/paper-trail-netflix/id1668440872\" target=\"_blank\">Paper Trail</a>",
      " - I had to came back to this one after some time, but then it clicked very well with me. ",
      "I loved the folding, the art style and the beatiful soundtrack I listen to from time to time ever since."
    ]
  },
  {
    "id": 2,
    "title": "Released (and finished) GOTY 2024",
    "icon": "img/logo.png",
    "date": "2024-12-29",
    "verdict": [
      "Here are my top 5 games that were released (and I finished them) in 2024:<br/><br/>",
      "1. <a href=\"https://apps.apple.com/us/app/braid-anniversary-edition/id6450126747\" target=\"_blank\">Braid, Anniversary Edition</a>",
      " - I never played the original and my brother did not quite finish it when it got released back in 2008... ",
      "Plus a former editor-in-chief of a gaming magazine once said that only really smart people can finish it without a guide. ",
      "All of this was additional motivation for me to finish it. Plus I could think about the levels even when not playing it which helped me a lot at that time.<br/><br/>",
      "2. <a href=\"https://apps.apple.com/us/app/arranger-netflix/id6450325217\" target=\"_blank\">Arranger</a>",
      " - Original, clever, funny, great looking and good sounding puzzling gem.<br/><br/>",
      "3. <a href=\"https://apps.apple.com/us/app/paper-trail-netflix/id1668440872\" target=\"_blank\">Paper Trail</a>",
      " - I had to came back to this one after some time, but then it clicked very well with me. ",
      "I loved the folding, the art style and the beatiful soundtrack I listen to from time to time ever since.<br/><br/>",
      "4. <a href=\"https://apps.apple.com/us/app/wildfrost/id6462882621\" target=\"_blank\">Wildfrost</a>",
      " - Definitely my favorite game soundtrack of 2024 (I know it released in 2023 ;). ",
      "Having the game in my pocket made the souondtrack sound even better. I did not \"finish\" many card games in my life, but enjoyed the heck out of this one.<br/><br/>",
      "5. <a href=\"https://apps.apple.com/us/app/balatro/id6502451661\" target=\"_blank\">Balatro</a>",
      " - I think you know what I'm talking about here."
    ]
  },
  {
    "id": 1,
    "title": "First Blog Post",
    "icon": "img/logo.png",
    "date": "2024-11-17",
    "verdict": "The very first blog post. There's not much more to say. Only time will tell if I will keep blogging or not..."
  }
]